{
    "Welche der nachfolgenden jQuery-Methoden gibt es ?\n": {
        "type": "Multiple choice (mehrfach)",
        "answers": [
            "a. query.get()",
            "b. jquery.getText()",
            "c. jquery.getXML()",
            "d. jquery.ajaxCompleted()",
            "e. jquery.getJSON()",
            "f. jquery.getScript()"
        ]
    },
    "Mit Hilfe eines jQuery-Selektors wurde eine Menge von HTML-Elementen selektiert.\n\n\nMit welcher jQuery-Methode kann man die als Parameter übergebenen CSS-Klassen der ausgewählten Elemente setzen bzw. entfernen, je nachdem, ob sie gesetzt waren oder nicht ?\n\n\nBeachten Sie: Groß-\/Kleinschreibung beim Methodennamen ist zu berücksichtigen!\n": {
        "type": "Text Input (qtype_pmatch \/ Essay)",
        "answers": ""
    },
    "Mit welcher jQuery-Methode kann man die Höhe des ersten ausgewählten Elements setzen bzw. abrufen, wobei Padding (padding) mit berücksichtigt werden soll, nicht aber die Randlinie (border) ?\n\nBeachten Sie: Groß-\/Kleinschreibung beim Methodennamen ist zu berücksichtigen!\n": {
        "type": "Text Input (qtype_pmatch \/ Essay)",
        "answers": ""
    },
    "Wie lange dauert das jQuery-FadeIn in Millisekunden in der Voreinstellung ?\n": {
        "type": "Single-line text input",
        "answers": ""
    },
    "Welche Aussage(n) ist\/sind im Zusammenhang mit jQuery richtig?\n\n\n": {
        "type": "Multiple choice (mehrfach)",
        "answers": [
            "a. Die Manipulation von HTML-Elementen lässt sich ausschließlich mit jQuery durchführen.",
            "b. JQuery stellt ein browserübergreifendes AJAX-API bereit.",
            "c. JQuery ist erweiterbar."
        ]
    },
    "Welche Aussage ist für das nachfolgende jQuery-Schnipsel richtig?\n\nvar hB = $(\"#banner-message\");\n$(\"#container button\").on(\"click\",function( event ){hB.show();});": {
        "type": "Multiple choice (einzeln)",
        "answers": [
            "a. Zeige das #banner-message Element, das mit \"display:none\" versteckt wurde, sobald eine Schaltfläche im Element \"#container\" betätigt wird.",
            "b. Zeige das \"#banner-message\" Element, das mit \"visibility:none\" versteckt wurde, sobald eine Schaltfläche im Element \"#container button\" betätigt wird."
        ]
    },
    "Gegeben sei eine nachfolgende HTML Seite mit einer ungeordneten Liste:\n\n<html>\n<body>\n\n<ul>\n  <li>list item 1<\/li>\n  <li>list item 2<\/li>\n  <li>list item 3<\/li>\n<\/ul>\n<\/body>\n<\/html>\n\n\n\n\nMit dem Selektor $(\"li\") wurden alle Listenelemente selektiert.\n\nMit welcher jQuery-Methode kann man die selektierte Menge auf das erste Listenelement reduzieren ?\n\n\nBeachten Sie: Groß-\/Kleinschreibung beim Methodennamen ist zu berücksichtigen!\n": {
        "type": "Text Input (qtype_pmatch \/ Essay)",
        "answers": ""
    },
    "Which of the following statements are true about AngularJS ? (Choose all that apply.)\n": {
        "type": "Multiple choice (mehrfach)",
        "answers": [
            "AngularJS provides a framework for model–view–viewmodel (MVVM) architectures.",
            "AngularJS provides a framework for client-side model–view–controller (MVC) architectures.",
            "AngularJS provides a framework for serverside model–view–viewmodel (MVVM) architectures.",
            "AngularJS provides components commonly used in poor Internet applications."
        ]
    },
    "Which AngularJS directive binds the value of HTML controls (input, select, textarea) to application data?\n": {
        "type": "Multiple choice (einzeln)",
        "answers": [
            "ng-controller",
            "ng-app",
            "ng-model",
            "ng-bind"
        ]
    },
    "Which of the following implementation details are true for AngularJS? (Choose all that apply.)\n": {
        "type": "Multiple choice (mehrfach)",
        "answers": [
            "AngularJS uses dependency injection.",
            "Angular brings client-side services to server-side web applications.",
            "AngularJS uses independent injection.",
            "Angular brings server-side services to client-side web applications."
        ]
    },
    "Which of the following statements are true? (Choose all that apply.)\n": {
        "type": "Multiple choice (mehrfach)",
        "answers": [
            "AngularJS is a framework for building client applications in JavaScript and the language TypeScript that transpiles to EC07.",
            "AngularJS lets you use HTML as your template language.",
            "AngularJS is a structural framework for dynamic web apps.",
            "AngularJS is a framework for building client applications in HTML and the language TypoScript that transpiles to EC07."
        ]
    },
    "Which of the following statements are true for AngularJS? (Choose all that apply.)\n": {
        "type": "Multiple choice (mehrfach)",
        "answers": [
            "Descriptive programming should be used to create user interfaces and connect software components.",
            "Imperative programming is suited to defining an AngularJS application's business logic."
        ]
    }
}